rdk/product/production/rdk/src/resources/patient-photo/xml/1309.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" >
    <soapenv:Header/>
    <soapenv:Body>
        <vaww:PRPA_IN201309UV02 xmlns:vaww="http://vaww.oed.oit.domain">
            <id extension="MCID-%(msgID)s" root="2.16.840.1.113883.4.349"/>
            <creationTime value="%(time)s"/>
            <versionCode code="3.0"/>
            <interactionId root="2.16.840.1.113883.1.6"/>
            <processingCode code="T"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.4.349"/>
                </device>
            </receiver>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id extension="%(sender)s" root="1.2.840.114350.1.13.99997.2.7788"/>
                </device>
            </sender>
            <controlActProcess classCode="CACT" moodCode="EVN">
                <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
                <dataEnterer contextControlCode="AP" typeCode="ENT">
                    <assignedPerson classCode="ASSIGNED">
                        <id extension="%(sender)s" root="2.16.840.1.113883.4.349"/>
                        <assignedPerson classCode="PSN" determinerCode="INSTANCE">
                            <name>
                                <given>%(firstname)s</given>
                                <family>%(lastname)s</family>
                            </name>
                        </assignedPerson>
                    </assignedPerson>
                </dataEnterer>
                <queryByParameter>
                    <queryId extension="%(msgID)s" root="1.2.840.114350.1.13.99999.4567.34"/>
                    <statusCode code="new"/>
                    <responsePriorityCode code="I"/>
                    <parameterList>
                        <patientIdentifier>
                            <value extension="%(id)s" root="2.16.840.1.113883.4.349"/>
                            <semanticsText>Patient.Id</semanticsText>
                        </patientIdentifier>
                    </parameterList>
                </queryByParameter>
            </controlActProcess>
        </vaww:PRPA_IN201309UV02>
    </soapenv:Body>
</soapenv:Envelope>
